In [1]:
import pandas as pd

In [2]:
raw_files_directory = "raw_data/data_files/"
example_raw_file = "CLIMAT_RAW_200303.txt"

## Read stations list

In [3]:
stations_file = "stations_list_CLIMAT_data.txt"

In [4]:
!head -5 stations_list_CLIMAT_data.txt

In [5]:
stations_df = pd.read_csv(stations_file, sep=';', header=0, encoding="ISO-8859-1")

In [6]:
stations_df.tail(3)

,WMO-Station ID,StationName,Latitude,Longitude,Height,Country
4396,99092,unknown station,,,,...
4397,99113,unknown station,,,,...
4398,,NaN,NaN,NaN,NaN,NaN

In [7]:
stations_df = stations_df.drop([stations_df.shape[0]-1])

In [8]:
stations_df.tail(3)

,WMO-Station ID,StationName,Latitude,Longitude,Height,Country
4395,99090,unknown station,,,,...
4396,99092,unknown station,,,,...
4397,99113,unknown station,,,,...

In [9]:
stations_df.head(3)

,WMO-Station ID,StationName,Latitude,Longitude,Height,Country
0,01001,Jan Mayen,70.94,-08.67,9,Norway
1,01005,Isfjord Radio,78.06,13.63,9,Norway
2,01007,Ny-Alesund,78.92,11.93,8,Norway

In [10]:
stations_df.columns = [col.strip() for col in stations_df.columns]

In [11]:
stations_df.columns

Index(['WMO-Station ID', 'StationName', 'Latitude', 'Longitude', 'Height',
       'Country'],
      dtype='object')

In [12]:
for col in stations_df.columns:
    stations_df[col] = stations_df[col].str.strip()

In [13]:
stations_df.dtypes

WMO-Station ID    object
StationName       object
Latitude          object
Longitude         object
Height            object
Country           object
dtype: object

In [14]:
stations_df = stations_df.astype({'WMO-Station ID':int}).rename(columns={'WMO-Station ID':'IIiii'})
#, 'Latitude': float, 'Longitude': float, 'Height': float})

In [15]:
stations_df.dtypes

IIiii           int64
StationName    object
Latitude       object
Longitude      object
Height         object
Country        object
dtype: object

In [16]:
stations_df['Country'].unique()

array(['Norway', 'Sweden', 'Finland',
       'United Kingdom of Great Britain and N.-Ireland', 'Ireland',
       'Iceland', 'Greenland', 'Faroe Islands', 'Denmark', 'Netherlands',
       'Belgium', 'Luxembourg', 'Switzerland', 'France', 'Spain',
       'Gibraltar', 'Portugal', 'Cape Verde', 'Germany', 'Austria',
       'Czech Republic', 'Slovakia (Slovak. Rep.)', 'Poland', 'Hungary',
       'Slowenia', 'Croatia/Hrvatska', 'Serbia', 'Bosnia and Herzegowina',
       'Montenegro', 'Macedonia', 'Albania', 'Romania', 'Bulgaria',
       'Italy', 'Malta', 'Greece', 'Turkey', 'Cyprus',
       'Russian Federation', 'Estonia', 'Latvia', 'Lithuania', 'Belarus',
       'Kazakhstan', 'Ukraine', 'Moldova, Rep. Of', 'Kyrgyzstan',
       'Georgia', '', 'Azerbaijan', 'Armenia', 'Uzbekistan',
       'Turkmenistan', 'Tajikistan', 'Syrian Arab Rep.', 'Lebanon',
       'Israel', 'Jordan', 'Saudi Arabia', 'Bahrain', 'Qatar', 'Oman',
       'Kuwait', 'Yemen', 'Iraq', 'Iran (Islamic Rep. of)', 'Afghanistan',
       'United Arab. Emirates', 'Pakistan', 'Bangladesh', 'India',
       'Sri Lanka', 'Maldives', 'Mongolia', 'Nepal', 'China',
       'Republic of China, Taiwan', "Korea, Dem. People's Rep.",
       'Republic of Korea', 'Japan', 'Myanmar', 'Thailand', 'Malaysia',
       'Singapore', 'Vietnam', "People's Dem. Rep. Laos", 'Cambodia',
       'Western-Sahara', 'Morocco', 'Algeria', 'Tunesia', 'Niger', 'Mali',
       'Mauretania', 'Senegal', 'Gambia', 'Guinea-Bissau', 'Guinea',
       'Sierra Leone', 'Ascencion Island', 'São Tomé und Príncipe',
       'Mauritius', 'Libya', 'Egypt', 'Sudan', 'South Sudan', 'Eritrea',
       'Djibouti', 'Somalia', 'Ethiopia', 'Kenya', 'Uganda', 'Tanzania',
       'Seychelles', 'Dem. Republic of the Congo', 'Rwanda', 'Burundi',
       'Republic of the Congo', 'Gabon', 'Central African Republic',
       'Chad', 'Equatorial Guinea', 'Cameroon', 'Nigeria', 'Benin', 'Togo',
       'Ghana', 'Burkina Faso', "Cote d'Ivoire", 'Liberia', 'Angola',
       'Comoros', 'Madagascar', 'Mozambique', 'Zambia', 'Malawi',
       'Zimbabwe', 'Namibia', 'Botswana', 'South Africa',
       'United States of America', 'Canada', 'Mexico', 'Bermuda',
       'Bahamas', 'Cuba', 'Cayman Islands', 'Jamaica', 'Haiti',
       'Dominican Republic', 'Honduras', 'Puerto Rico', 'Belize',
       'Guatemala', 'El Salvador', 'Nicaragua', 'Costa Rica',
       'St. Maarten', 'Guadeloupe', 'Martinique', 'Barbados',
       'Trinidad and Tobago', 'Aruba', 'Curacao', 'Colombia', 'Venezuela',
       'Guyana', 'Suriname', 'French Guiana', 'Brazil', 'Ecuador', 'Peru',
       'Bolivia', 'Chile', 'Paraguay', 'Uruguay', 'Argentina',
       'Antarctica', 'Australia', 'New Zealand', 'Guam',
       'Marianen-Islands', 'Wake-Insel', 'Caroline-Islands',
       'Marshall-Islands', 'Palau-Islands', 'Salomon-Islands', 'Vanuatu',
       'New Caledonia', 'Kiribati', 'Tuvalu', 'Fiji', 'Wallis-Islands',
       'West-Samoa', 'American Samoa', 'Cook-Island', 'French Polynesia',
       'Papua New Guinea', 'Indonesia', 'Brunei', 'Australien, SW-Pazifik',
       'Indonesien', 'Timor-Leste (East Timor)', 'Philippines'], dtype=object)

## Read a sample data file

In [17]:
raw_files_directory = "raw_data/data_files/"
example_raw_file = "CLIMAT_RAW_202107.txt"

sample_raw_file_df = pd.read_csv(raw_files_directory + example_raw_file, sep=';', header=0, encoding="ISO-8859-1", usecols=["year", "month", "IIiii", "T", "Tn", "Tx"])

In [18]:
! head -3 raw_data/data_files/CLIMAT_RAW_202107.txt

In [19]:
sample_raw_file_df = sample_raw_file_df.drop([sample_raw_file_df.shape[0]-1])

In [20]:
sample_raw_file_df.describe()

        month         IIiii            T           Tx           Tn
count  2779.0   2779.000000  2684.000000  2655.000000  2647.000000
mean      7.0  52951.400864   219.991058   275.133333   170.676993
std       0.0  29241.539207    73.647759    75.611954    74.709411
min       7.0   1001.000000     0.000000     2.000000     0.000000
25%       7.0  26864.000000   177.000000   234.000000   124.000000
50%       7.0  60429.000000   226.000000   285.000000   170.000000
75%       7.0  76141.000000   272.000000   322.000000   228.000000
max       7.0  98851.000000   671.000000   625.000000   711.000000

In [21]:
sample_raw_file_df.tail()

      year  month    IIiii      T     Tx     Tn
2774  2021    7.0  98646.0  293.0  326.0  260.0
2775  2021    7.0  98653.0  291.0  325.0  239.0
2776  2021    7.0  98755.0  291.0  338.0  243.0
2777  2021    7.0  98836.0  291.0  340.0  242.0
2778  2021    7.0  98851.0  266.0  309.0  222.0

In [22]:
sample_raw_file_df.columns

Index(['year', 'month', 'IIiii', 'T', 'Tx', 'Tn'], dtype='object')

In [23]:
sample_raw_file_df['IIiii'].nunique()

2779

In [24]:
sample_raw_file_df.dtypes

year      object
month    float64
IIiii    float64
T        float64
Tx       float64
Tn       float64
dtype: object

In [25]:
sample_raw_file_df = sample_raw_file_df.astype({'IIiii':int, 'year': int, 'month': int})

## Check data for some places manually

In [26]:
stations_df.columns

Index(['IIiii', 'StationName', 'Latitude', 'Longitude', 'Height', 'Country'], dtype='object')

In [27]:
stations_df.dtypes

IIiii           int64
StationName    object
Latitude       object
Longitude      object
Height         object
Country        object
dtype: object

In [29]:
stations_df.shape

(4398, 6)

In [31]:
stations_df['IIiii'].unique()

array([ 1001,  1005,  1007, ..., 99090, 99092, 99113])

In [32]:
stations_df[stations_df['IIiii']==1001]

   IIiii StationName Latitude Longitude Height Country
0   1001   Jan Mayen    70.94    -08.67      9  Norway

In [34]:
stations_df[stations_df['Country']=='India']

      IIiii                 StationName Latitude Longitude Height Country
1520  42027                    Srinagar    34.08     74.83   1587   India
1521  42034                         Leh    34.15     77.57   3513   India
1522  42071                    Amritsar    31.71     74.80    234   India
1523  42099                    Ludhiana    30.93     75.87    247   India
1524  42131                      Hissar    29.17     75.73    210   India
1525  42147                  Mukteshwar    29.47     79.65   2311   India
1526  42165                     Bikaner    28.00     73.30    224   India
1527  42182  New Delhi/Safdarjung Airp.    28.58     77.20    216   India
1528  42260                        Agra    27.15     77.97    169   India
1529  42261                        Agra    27.17     78.03    169   India
1530  42295                  Darjeeling    27.05     88.26   2134   India
1531  42314             Dibrugarh Airp.    27.48     95.02    111   India
1532  42339                     Jodhpur    26.25     73.05    221   India
1533  42348             Jaipur/Sanganer    26.82     75.80    390   India
1534  42391                   Darbhanga    26.17     85.90     49   India
1535  42404                      Dhubri    26.02     89.98     35   India
1536  42410              Guwahati Airp.    26.10     91.58     54   India
1537  42451                        Kota    25.18     75.85    256   India
1538  42452                        Kota    25.16     75.85    279   India
1539  42475                   Allahabad    25.45     81.73     98   India
1540  42492                       Patna    25.19     85.09     57   India
1541  42515                 Cherrapunji    25.25     91.73   1300   India
1542  42587                  Daltonganj    24.05     84.07    221   India
1543  42599                       Dumka    24.27     87.25    149   India
1544  42619                     Silchar    24.82     92.80     21   India
1545  42647                   Ahmadabad    23.07     72.63     56   India
1546  42671                       Sagar    23.85     78.75    550   India
1547  42731                      Dwarka    22.37     69.08     11   India
1548  42754                      Indore    22.72     75.80    567   India
1549  42807          Kolkata (Calcutta)    22.53     88.33      6   India
1550  42867                      Nagpur    21.10     79.05    310   India
1551  42909                     Veraval    20.90     70.37     12   India
1552  42933                       Akola    20.70     77.03    282   India
1553  42970                     Cuttack    20.47     85.93     27   India
1554  42971                 Bhubaneswar    20.24     85.82     49   India
1555  43003            Bombay/Santacruz    19.09     72.87      8   India
1556  43041                   Jagdalpur    19.08     82.03    554   India
1557  43057               Mumbai/Colaba    18.90     72.81     11   India
1558  43063                        Pune    18.53     73.85    558   India
1559  43128             Hyderabad Airp.    17.45     78.47    535   India
1560  43149        Vishakhapatnam Airp.    17.72     83.23      3   India
1561  43150              Vishakhapatnam    17.68     83.29     70   India
1562  43185               Machilipatnam    16.20     81.15     10   India
1563  43192                      Panjim    15.48     73.82     64   India
1564  43197                     Belgaum    15.85     74.53    753   India
1565  43198               Belgaum Airp.    15.86     74.62    747   India
1566  43279      Chennai (Madras) Airp.    13.00     80.18     16   India
1567  43283                   Mangalore    12.87     74.85     22   India
1568  43284             Mangaluru Airp.    12.96     74.89    106   India
1569  43295                   Bangalore    12.97     77.58    923   India
1570  43314                   Kozhikode    11.25     75.78      5   India
1571  43333                  Port Blair    11.67     92.72     79   India
1572  43363                      Pamban    09.28     79.22     11   India
1573  43369          Minicoy/Lakkadiven    08.28     73.05      2   India
1574  43371          Thiruvananthapuram    08.48     76.95     64   India
3890  89514                      Maitri   -70.77     11.73    183   India
3927  89776                     Bharati   -69.41     76.19     33   India

In [35]:
delhi_station_id = 42182
leh_station_id = 42034

In [41]:
sample_raw_file_df[sample_raw_file_df['IIiii'].isin([delhi_station_id, leh_station_id, 42027])]

      year  month  IIiii      T     Tx     Tn
1052  2021      7  42027  247.0  300.0  195.0
1056  2021      7  42182  314.0  365.0  264.0

In [39]:
sample_raw_file_df['IIiii'].nunique()

2779

In [40]:
stations_df['IIiii'].nunique()

4398